{
    "footer":{
        "address":"Mendigoules, 43190 Tence, France ",
        "about": "2023 - Jules Digonnet ",
        "TermsOfUse": "Mentions légales"
    },
    "navbar":{
        "home":"home",
        "company": "Mon Entreprise",
        "study": "Ma formation",
        "skills": "Mes projets"
    },
    "legalNotice":{
      "title": "Mentions légales",
      "information":{
        "title": "1. Informations générales",
        "content": " Nom du site : digonnetjules.fr\\n Propriétaire : Digonnet Jules\\n Adresse : Mendigoules, 43190 Tence\\n Adresse e-mail : {email} "
      },
      "hosting": {
        "title": "2. Hébergement",
        "content": "Hébergé par : OVH\\n Adresse : 59820 Gravelines, Nord-Pas-de-Calais-Picardie, France"
      },
      "intellectualProperty": {
        "title": "3. Propriété intellectuelle",
        "content": "Le contenu de ce site (textes, images, etc.) est la propriété intellectuelle de Digonnet Jules. Toute reproduction sans autorisation est interdite."
      },
      "noPersonalData": {
        "title": "4. Absence de collecte de données personnelles",
        "content": "Ce site portfolio ne collecte aucune donnée personnelle. Aucun formulaire de contact, suivi d'analyse ou autre mécanisme de collecte d'informations personnelles n'est présent."
      },
      "cookies": {
        "title": "5. Cookies",
        "content": "Ce site n'utilise pas de cookies de suivi ni d'autres technologies similaires."
      },
      "responsibility": {
        "title": "6. Responsabilité",
        "content": "L'auteur de ce site ne peut être tenu responsable de l'utilisation faite du contenu présenté. Ce site est fourni à titre informatif uniquement."
      },
      "externalLinks": {
        "title": "7. Liens externes",
        "content": "Ce site peut contenir des liens vers des sites externes. L'auteur n'assume aucune responsabilité quant au contenu de ces sites."
      },
      "contact": {
        "title": "8. Contact",
        "content": "Pour toute question ou préoccupation concernant ces mentions légales, veuillez nous contacter à l'adresse e-mail suivante : {email}  "
      }
    },
    "dashboard":{
        "title": "Accueil",
        "introducing":{
            "study": "Data Engineering",
            "internship": "en Alternance"
        },
        "compagny":{
            "title": "Mon Entreprise",
            "texte":{
                "title":"DATIPLUS l’expert n°1 pour protéger les travailleurs isolés.",
                "part1":"Avec notre marque commerciale DATIPLUS,nous protégeons les salariés isolés de plus de 1 500 entreprises.",
                "part2": "Confortables, nos solutions s’adaptent à tous. La protection se fait oublier. Des capteurs de mouvements détectent en permanence l’activité du porteur.",
                "part3": "Des algorithmes d’intelligence artificielle traitent ces données pour apprendre les habitudes de chaque utilisateur et mieux détecter les situations anormales (chute, moindre activité, réveil tardif…).",
                "part4": "Dès qu’une situation de détresse est détectée, l’alerte est transmise à des contacts de l’entreprise ou à un PC de sécurité."
            } 
        },
        "study":{
            "title": "Ma formation",
            "units":"Modules :",
            "BTS": {
                "title": "BTS SIO",
                "date": "2020 - 2022",
                "development": {
                    "title": "Développement Logiciel et Applications",
                    "texte" : "Apprentissage des langages de programmation (Java, C#, PHP, Python,Html,Css.).Création d'applications logicielles répondant aux besoins des organisations.Conception, modélisation et intégration de solutions informatiques."
                },
                "projectManagement": {
                    "title": "Gestion de Projets Informatiques",
                    "texte" : "Utilisation de méthodologies de gestion de projets (agile, scrum, etc.).Planification, suivi et gestion des projets de développement informatique.Intégration et déploiement des logiciels dans l'environnement organisationnel."
                },
                "dataBase": {
                    "title": "Bases de Données et Systèmes Informatiques",
                    "texte" : "Conception, création et gestion de bases de données.Compréhension des principes et fonctionnement des systèmes informatiques.Administration et maintenance des réseaux informatiques."
                },
                "communication": {
                    "title": "Communication, Support Technique et Travail d'Équipe",
                    "texte" : "Bonne communication et compréhension des besoins des utilisateurs.Support technique aux utilisateurs et aux équipes internes.Capacité à travailler en équipe et à collaborer avec d'autres professionnels."
                }
            },
            "engineer": {
                "title": "Ingénieur en apprentissage",
                "date": "2022 - 2025",
                "development": {
                    "title": "Développement",
                    "texte" : "Algorithmique et structures de données (langage C), Systèmes et outils Linux, Technologies Web, Développement pour l’embarqué (langage C), Programmation orientée objet, Langages scripts, Applications distribuées, Génie logiciel."
                },
                "electronics": {
                    "title": "Captation, Transmission, Électronique",
                    "texte" : "Électronique : instrumentation et captation de données, Physique des transmissions, Composants pour architecture d’exécution, Chaîne de télécommunications, Principe des réseaux, Objets communicants : protocoles de communication, Technologies et environnements embarqués, Conception de systèmes embarqués temps réel, Applications embarquées et cross compilation, Sécurisation des échanges de données et des matériels."
                },
                "dataBase": {
                    "title": "Data",
                    "texte" : "Base de données relationnelles, NoSQL, Calcul et outils de programmation numériques, Sauvegarde des données, Algorithmes pour l’analyse des données, Visualisation des données, Données spécifiques, Cloud computing, apprentissage Automatique, projet big data et BI."
                },
                "professionalEnvironment": {
                    "title": "Environnement professionnel",
                    "texte" : "Gestion de projet, Législation numérique, Technique d’expression écrite, Anglais, Technique de créativité, Gestion financière, Marketing, Management RH, Stratégie d’entreprise."
                }
            }
        },
        "skills": {
                "csharp": "C#",
                "cpp": "C++",
                "php": "PHP",
                "html": "HTML",
                "css": "CSS",
                "python": "Python",
                "sql": "SQL",
                "javascript": "JavaScript",
                "bootstrap": "Bootstrap",
                "symfony": "Symfony",
                "vuejs": "Vuejs3",
                "fastapi": "FastAPI",
                "mysql": "MySQL",
                "postgresql": "PostgreSQL",
                "docker": "Docker",
                "git": "Git/GitHub"
        },
        "projects": {
            "title": "Mes projets",
            "fc_tence_foot": {
              "title": "FC Tence (05/31/2021-06/27/2021)",
              "description": " Au cours de mon stage de développement web, j'ai créé un site en utilisant HTML, CSS et PHP Object. J'ai conçu une interface responsive, mis en place une gestion de données interactive, optimisé les performances et renforcé la sécurité. Ce projet a consolidé mes compétences en développement web et m'a permis de créer un site fonctionnel."
            },
            "mairie_tence": {
              "title": "Mairie de Tence (01/03/2022-02/11/2022)",
              "description": " Lors de mon stage en développement web à la Mairie de Tence, j'ai créé un site entièrement personnalisé en utilisant HTML, CSS, Bootstrap, et un framework PHP que j'ai développé de A à Z. J'ai conçu une interface conviviale et intégré des fonctionnalités interactives pour améliorer la présence en ligne de la Mairie."
            },
            "portfolio_bts": {
              "title": "Portfolio BTS",
              "description": "Mon portfolio BTS en développement web est le fruit de mon engagement dans la création complète d'un site web. J'ai utilisé un éventail de technologies, notamment HTML, CSS, JavaScript, Bootstrap, PHP, et le concept de programmation orientée objet (PHP Object). J'ai conçu ce site web de A à Z, en faisant de la première mise en ligne une étape majeure de mon parcours."
            },
            "mon_entreprise": {
              "title": "Espace client Datiplus",
              "description": "Actuellement en période d'apprentissage, j'ai eu l'opportunité de contribuer au projet de l'espace client 'Datiplus' basé sur le framework PHP Symfony. Au sein de cette équipe, j'ai pu participer à l'amélioration de fonctionnalités existantes, à la création de nouvelles fonctionnalités et à l'intégration d'un nouveau produit. Cette expérience m'a non seulement permis d'apprendre davantage sur Symfony, mais également de découvrir le monde professionnel du développement web, ce qui enrichit ma formation actuelle."
            },
            "portfolio_ecole_ingenieur": {
              "title": "Portfolio",
              "description": "Mon portfolio actuel reflète ma formation et mes compétences en constante évolution. Je travaille avec Symfony 7 en tant que framework principal, tout en m'immergeant dans l'apprentissage de Vue.js 3 pour des applications frontend dynamiques. Mes connaissances en HTML, CSS, Bootstrap, JavaScript, Docker et PHP continuent de s'enrichir. J'exploite ces compétences en constante évolution pour développer des projets web de qualité tout en restant à la pointe des dernières technologies."
            },
            "datawave": {
                "title": "Datawave",
                "description": "Le projet Datawave a été conçu lors du workshop Green IT, organisé par Télécom Saint-Étienne en collaboration avec le Département de la Loire. Notre mission : développer des solutions numériques innovantes pour une gestion durable et efficiente de l'eau. Ce partenariat a créé un environnement propice à l'émergence d'idées novatrices, et le projet Datawave incarne notre engagement envers des pratiques responsables dans le domaine de la gestion de l'eau."
            }
        }
    }
}
  