{
    "footer": {
        "adress": "Mendigoules, 43190 Tence, France",
        "about": "2023 - Jules Digonnet",
        "TermsOfUse": "Legal Notice"
    },
    "navbar": {
        "home": "home",
        "compagny": "My Company",
        "study": "My Education",
        "skills": "My Projects"
    },
    "dashboard": {
        "title": "Home",
        "introducing": {
            "study": "Data Engineering",
            "intership": "Internship"
        },
        "compagny": {
            "title": "My Company",
            "texte": {
                "title": "DATIPLUS the #1 expert in protecting isolated workers.",
                "part1": "With our commercial brand DATIPLUS, we protect isolated employees from over 1,500 companies.",
                "part2": "Comfortable, our solutions adapt to everyone. Protection becomes unobtrusive. Motion sensors constantly detect the wearer's activity.",
                "part3": "Artificial intelligence algorithms process this data to learn each user's habits and better detect abnormal situations (falls, decreased activity, late waking, etc.).",
                "part4": "As soon as a distress situation is detected, an alert is sent to company contacts or a security control room."
            }
        },
        "study": {
            "title": "My Education",
            "units": "Modules:",
            "BTS": {
                "title": "BTS IT Services",
                "date": "2020 - 2022",
                "development": {
                    "title": "Software Development and Applications",
                    "texte": "Learning programming languages (Java, C#, PHP, Python, HTML, CSS). Creating software applications that meet organizational needs. Designing, modeling, and integrating IT solutions."
                },
                "projectManagement": {
                    "title": "IT Project Management",
                    "texte": "Using project management methodologies (agile, scrum, etc.). Planning, monitoring, and managing IT development projects. Integrating and deploying software in the organizational environment."
                },
                "dataBase": {
                    "title": "Databases and IT Systems",
                    "texte": "Designing, creating, and managing databases. Understanding the principles and operation of IT systems. Administering and maintaining IT networks."
                },
                "communication": {
                    "title": "Communication, Technical Support, and Teamwork",
                    "texte": "Good communication and understanding of user needs. Technical support for users and internal teams. Ability to work in a team and collaborate with other professionals."
                }
            },
            "engineer": {
                "title": "Apprentice Engineer",
                "date": "2022 - 2025",
                "development": {
                    "title": "Development",
                    "texte": "Algorithms and data structures (C language), Linux systems and tools, Web technologies, Embedded systems development (C language), Object-oriented programming, Scripting languages, Distributed applications, Software engineering."
                },
                "electronics": {
                    "title": "Data Capture, Transmission, Electronics",
                    "texte": "Electronics: data instrumentation and capture, Transmission physics, Components for execution architecture, Telecommunication chain, Network principles, Communicating objects: communication protocols, Embedded technologies and environments, Real-time embedded system design, Embedded and cross-compiled applications, Securing data and hardware exchanges."
                },
                "dataBase": {
                    "title": "Data",
                    "texte": "Relational databases, NoSQL, Numeric programming and calculation tools, Data backup, Algorithms for data analysis, Data visualization, Specific data, Cloud computing, Machine learning, big data and BI projects."
                },
                "professionalEnvironment": {
                    "title": "Professional Environment",
                    "texte": "Project management, Digital legislation, Written expression techniques, English, Creativity techniques, Financial management, Marketing, HR management, Business strategy."
                }
            }
        },
        "skills": {
            "csharp": "C#",
            "cpp": "C++",
            "php": "PHP",
            "html": "HTML",
            "css": "CSS",
            "python": "Python",
            "sql": "SQL",
            "javascript": "JavaScript",
            "bootstrap": "Bootstrap",
            "symfony": "Symfony",
            "vuejs": "Vue.js 3",
            "fastapi": "FastAPI",
            "mysql": "MySQL",
            "postgresql": "PostgreSQL",
            "docker": "Docker",
            "git": "Git/GitHub"
        },
        "projects": {
            "title": "My Projects",
            "fc_tence_foot": {
                "title": "FC Tence (05/31/2021-06/27/2021)",
                "description": "During my web development internship, I created a site using HTML, CSS, and PHP Object. I designed a responsive interface, implemented interactive data management, optimized performance, and reinforced security. This project strengthened my web development skills and allowed me to create a functional website."
            },
            "mairie_tence": {
                "title": "Tence Town Hall (01/03/2022-02/11/2022)",
                "description": "During my web development internship at the Tence Town Hall, I created a fully customized site using HTML, CSS, Bootstrap, and a PHP framework developed from scratch. I designed a user-friendly interface and integrated interactive features to enhance the town hall's online presence."
            },
            "portfolio_bts": {
                "title": "BTS Portfolio",
                "description": "My BTS web development portfolio showcases my commitment to creating a complete website. I used a range of technologies, including HTML, CSS, JavaScript, Bootstrap, PHP, and object-oriented programming (PHP Object). I designed this website from scratch, marking a significant milestone in my journey."
            },
            "mon_entreprise": {
                "title": "Datiplus Client Space",
                "description": "Currently in a learning phase, I had the opportunity to contribute to the 'Datiplus' client space project based on the Symfony PHP framework. Within this team, I participated in enhancing existing features, creating new functionalities, and integrating a new product. This experience not only allowed me to learn more about Symfony but also introduced me to the professional world of web development, enriching my current education."
            },
            "portfolio_ecole_ingenieur": {
                "title": "Portfolio",
                "description": "My current portfolio reflects my ever-evolving education and skills. I work with Symfony 6 as the main framework while delving into learning Vue.js 3 for dynamic frontend applications. My knowledge in HTML, CSS, Bootstrap, JavaScript, Docker, and PHP continues to grow. I leverage these ever-evolving skills to develop quality web projects while staying at the forefront of the latest technologies."
            }
        }
    }
}
